{
  "notes": [
    {
      "id": 1,
      "title": "React Notes",
      "date": "2019-10-17",
      "topics": "state, props",
      "instructor": "Brenda Long",
      "content": "A component is created by extending upon the React-component class. You then define the methods for the component, such as render. Inside render, you'll return a description of what you want react to draw on the page.                          There are 2 types of data in react. The first is props. props are external and not controlled by the component itself. they are passed down from components higher up in the hierarchy who also control the data. The other type of data is called state. state is private and can be changed within the component itself. if you want the data in your app to change, for example based on user interactions, it must be stored in componets state somewhere in the app. to initialize state, simply set this.state in the constructor method of the class. to update/modify state, call this.setState, passing in the new state object as the argument.",
      "notebookId": 7
    },
    {
      "id": 4,
      "title": "React Lifecycle method",
      "date": "2019-10-19",
      "topics": "lifecycle methods, componentDidMount",
      "instructor": "Brenda Long",
      "content": "Each component in react has several lifecycle methods that you can override to run code at particular times in the process. Mounting methods are called in the following order when an instance of a component is being created and insterted into the DOM: constructor(), static getDerivedStateFromProps(), render(), componentDidMount(). An update can be caused by changes to props or state. these methods are called in the following order when a component is being re-rendered: static getDerivedStateFromProps(), shouldComponetUpdate(), render(), getSnapshotBeforeUpdate(), componentDidUpdate().                 The unmounting method is called when a component is being removed from the DOM: componentWillUnmount().                going into detail regarding some of the methods.... the render() method is the only required method in a class componet. when called it should examine this.props and this.state and return one of the following elements: react elements, arrays and fragments, portals, strings and numbers, booleans or null.                 componentDidMount() is invoked immediately after a component is mounted. initialization that requires DOM nodes should go here. if you need to load data from a remote endpoint, this is a good place to instantiate the network request. you may call setState() immediately in componentDidMount(). it will trigger an extra rendering, but it will happen before the browser updates the screen. this guarantees that even though the render() will be called twice in this case, the user won't see the intermediate state. ",
      "notebookId": 7
    },
    {
      "id": 5,
      "title": "Quiz questions and answers",
      "date": "2016-01-25",
      "topics": "dieting, stretching, resistance training",
      "instructor": "Dr. Lewis",
      "content": "1.Dehydration of what percent of body weight will decrease performance? ->1.5%.          2.RM and 1RM mean what? rep max and 1 rep max              3.Rest and recovery occurs between what?  -sets, reps, exercises                    4.Less rest between sets is effective in what?   -increasing muscle size                  5.Difference b/w linear and nonlinear periodization: linear means theres a target date you're shooting for. nonlinear cna change up weekly or every workout.                    6. Define supersetting: doing 2 different exercises for 2 different muscle groups. do push then pull                   7. What does SSC stand for? what does it replace?     -stretch shortening cycle, plyometrics",
      "notebookId": 9
    },
    {
      "title": "Intro to physics notes",
      "date": "2019-10-26",
      "topics": "newton's laws, levers, ",
      "instructor": "Professor Wright",
      "content": "Force = mass x acceleration         there are different types of levers. third class levers create speed. second class levers are the most powerful and are your prime accelerators.",
      "notebookId": 5,
      "id": 6
    }
  ],
  "tasks": [
    {
      "taskName": "eat foods",
      "completed": true,
      "date": "2019-10-17",
      "userId": 4,
      "id": 12
    },
    {
      "id": 13,
      "taskName": "working now",
      "completed": false,
      "date": "2019-01-01",
      "userId": 4
    },
    {
      "id": 14,
      "taskName": "eat food ",
      "completed": true,
      "date": "2019-10-26",
      "userId": 4
    }
  ],
  "deadlines": [
    {
      "title": "ROUND TABLE TALKSS",
      "date": "2019-10-24",
      "userId": 4,
      "id": 2
    },
    {
      "id": 4,
      "title": "lalalala momo",
      "date": "2019-01-01",
      "userId": 4
    },
    {
      "id": 5,
      "title": "work on capstone!!",
      "date": "2019-10-25",
      "userId": 4
    }
  ],
  "friends": [],
  "users": [
    {
      "id": 1,
      "username": "heidi@heidi.com",
      "password": "heidi"
    },
    {
      "username": "sage@sage.com",
      "password": "sage",
      "id": 2
    },
    {
      "username": "aryn@aryn.com",
      "password": "aryn",
      "id": 3
    },
    {
      "username": "a@a.com",
      "password": "a",
      "id": 4
    }
  ],
  "notebooks": [
    {
      "subject": "Anatomy",
      "userId": 4,
      "id": 4
    },
    {
      "subject": "physics",
      "userId": 4,
      "id": 5
    },
    {
      "subject": "javascript",
      "userId": 4,
      "id": 6
    },
    {
      "subject": "React",
      "userId": 4,
      "id": 7
    },
    {
      "id": 9,
      "subject": "Principles of Resistance Training",
      "userId": 3
    },
    {
      "id": 10,
      "subject": "MOMOMOmomo",
      "userId": 4
    }
  ]
}