{
  "notes": [
    {
      "id": 1,
      "title": "React Notes (sage)",
      "date": "2019-10-17",
      "topics": "state, props",
      "instructor": "Brenda Long",
      "content": "A component is created by extending upon the React-component class. You then define the methods for the component, such as render. Inside render, you'll return a description of what you want react to draw on the page.                          There are 2 types of data in react. The first is props. props are external and not controlled by the component itself. they are passed down from components higher up in the hierarchy who also control the data. The other type of data is called state. state is private and can be changed within the component itself. if you want the data in your app to change, for example based on user interactions, it must be stored in componets state somewhere in the app. to initialize state, simply set this.state in the constructor method of the class. to update/modify state, call this.setState, passing in the new state object as the argument.",
      "notebookId": 10,
      "rating": 0
    },
    {
      "id": 2,
      "title": "React Lifecycle method",
      "date": "2019-10-19",
      "topics": "lifecycle methods, componentDidMount",
      "instructor": "Brenda Long",
      "content": "Each component in react has several lifecycle methods that you can override to run code at particular times in the process. Mounting methods are called in the following order when an instance of a component is being created and insterted into the DOM: constructor(), static getDerivedStateFromProps(), render(), componentDidMount(). An update can be caused by changes to props or state. these methods are called in the following order when a component is being re-rendered: static getDerivedStateFromProps(), shouldComponetUpdate(), render(), getSnapshotBeforeUpdate(), componentDidUpdate().                 The unmounting method is called when a component is being removed from the DOM: componentWillUnmount().                going into detail regarding some of the methods.... the render() method is the only required method in a class componet. when called it should examine this.props and this.state and return one of the following elements: react elements, arrays and fragments, portals, strings and numbers, booleans or null.                 componentDidMount() is invoked immediately after a component is mounted. initialization that requires DOM nodes should go here. if you need to load data from a remote endpoint, this is a good place to instantiate the network request. you may call setState() immediately in componentDidMount(). it will trigger an extra rendering, but it will happen before the browser updates the screen. this guarantees that even though the render() will be called twice in this case, the user won't see the intermediate state. ",
      "notebookId": 10,
      "rating": 4
    },
    {
      "id": 5,
      "title": "Quiz questions and answers",
      "date": "2016-01-25",
      "topics": "dieting, stretching, resistance training",
      "instructor": "Dr. Lewis",
      "content": "1.Dehydration of what percent of body weight will decrease performance? ->1.5%.          2.RM and 1RM mean what? rep max and 1 rep max              3.Rest and recovery occurs between what?  -sets, reps, exercises                    4.Less rest between sets is effective in what?   -increasing muscle size                  5.Difference b/w linear and nonlinear periodization: linear means theres a target date you're shooting for. nonlinear cna change up weekly or every workout.                    6. Define supersetting: doing 2 different exercises for 2 different muscle groups. do push then pull                   7. What does SSC stand for? what does it replace?     -stretch shortening cycle, plyometrics",
      "notebookId": 9,
      "rating": 0
    },
    {
      "title": "Intro to physics notes",
      "date": "2019-10-26",
      "topics": "newton's laws, levers, ",
      "instructor": "Professor Wright",
      "content": "Force = mass x acceleration         there are different types of levers. third class levers create speed. second class levers are the most powerful and are your prime accelerators.",
      "notebookId": 5,
      "id": 6,
      "rating": 0
    },
    {
      "title": "Femur-Aryn",
      "date": "2019-10-20",
      "topics": "lower limb, femur",
      "instructor": "Dr. Lewis",
      "content": "the fumur is the longest and heavist bone in the body. it's about one fourth of a person's total height. the femur upper end includes:     head: this is the near spherical portion which forms the ball of the ball and socket hip joint,     neck: this is the narrowed are which connects the head to the body of the femur.          greater and lesser trochanter: projections of bones allowing the attachment of muscles.            the long central shaft of the femur is slightly bowed, being concave on its posterior surface.     the lower end of the femur is made up of two enlarged bony processes, the medial and lateral femoral condyles. These carry the smooth cureved surfaces which articulate with the tibia and patella to form the knee joint.      MUSCLES OF THE FEMUR: osme muscles such as the powerful glute shave their origins in the pelvic bones and so cross the hip joint to insert into the femur. when these muscles contract they cause the hip joint to move, allowing the leg to bend, straighten or move sideways. Other muscles originate on the femur itself and pass down across the knee joint to insert on the tibia or fibula. These muscles allow the knee to bend and straighten. ",
      "notebookId": 4,
      "id": 7,
      "rating": 0
    },
    {
      "id": 8,
      "title": "Tibia and Fibula-Arynnnn",
      "date": "2019-10-11",
      "topics": "tibia, fibula, muscles, lower limb, ligaments",
      "instructor": "Dr. Lewis",
      "content": "The tibia is the much larger bone of the lower leg. its stronger than the fibula as it must bear the weight of the body. The tibia which is the shin-bone, articulates with the thigh bone above, the ankle below and the fibula to the side. the thinner fibula helps to form the ankle joint. The tibia is a long bone and lies along side the fibula on the medial (inner) side and articulates w/ the fibula at its upper and lower ends. the upper end of the tibia is expanded to form the medial and lateral tibial condyles, which articulate with the femoral condyles at the knee joint. the lower end of the tibia is less pronounced than the upper end. it articulates with both the talus and with the lower end of the fibula.          FIBULA: the fibula lays on the lateral side of the tibia. it plays no important part in the knee joint, but it very important support for the ankle. The shaft of the fibula is narrow and bears the grooves and ridges associated w/ its major role as a site of muscle attatchment for the leg.      LIGAMENTS: the procimal (upper) end: just under the knee is the upper joint between the head of the fibula and the underside of the lateral tibial condyle. The joint is surrounded and protected by a fibrous joint capsule, which is strengthened by the anterior and posterior tibiofibular ligaments. The anterior ligaments of the head of the fibula runs from the front of the fibular head across to the front of the lateral tibial condyle. the posterior ligament of the head of the fibula runs in a similar fashion behind the fibular head. other ligaments bind the bones of the lower leg to the femur. the strongest of these are the medial and lateral collateral ligaments of the knee joint, which run vertically down from the femur to the corresponding bone (tibia or fibula) beneath. DISTAL END: the joint b/w the lower ends of the tibia and fibula allows no movement of one bone upon the other. rather, the fibula is bound tightly to the tibia by  fibrous ligaments in order to maintain the stability of the ankle joint. the main ligaments concerned are the ant and post tib-fib ligaments. other ligaments around the ankle bind the tibia and fibula to the bones of the foot.",
      "notebookId": 4
    },
    {
      "title": "Lifting safely",
      "date": "2019-02-26",
      "topics": "exercise, resistance training, warm up, cool down, stretching, ",
      "instructor": "Dr. Lewis",
      "content": "you should warm up before lifting with at least 5-10 minutes of light cardio. 1-2 light warm up sets at 50%RM shouldnt be counted in total sets. Cool down is extremely important. it helps the body bounce back, helps muscles recover. 5-10 minutes of upper/lower aerobic activity should suffice. STRETCHING: improves muscular flexibility and good range of motion. helps LBP. stretch following cool down activities. Resistance training improves muscle strength and health along with strengthening bones, tendons and ligaments. THe 4 basic types of stretching include: 1. static stretching (makes muscle weaker)   2.Ballistic stretching: usually done by high end athletes, also called bounce stretching       3.Partner Stretching: most dangerous type of stretching and should be avoided      4.Proprioceptive Neuromuscular Facilitation: aka PNF",
      "notebookId": 9,
      "id": 9,
      "rating": 0
    },
    {
      "title": "Best tricks for css (taylor)",
      "date": "2019-7-26",
      "topics": "css, positioning, ",
      "instructor": "Michael Conrad",
      "content": "if you want control over wherean element lives on our website at all times, absolute positioning is the key to making this happen. If you think of your browser as one big bounding box, absolute positioning allows you to control exactly where in that box an element will stay. Use top, right, bottom and left, accompanied by a pixel value to control where an element stays. Setting the position to absolute can also happen in a div.        CENTERING: 1.text: text is centered using the text-align: center. if you want it to either side use left or right instead of center. 2.Content: a div or any other element can be centered by adding the block property to it, and then using auto margins. the css would look like.... display:block; margin:auto;      HOVER EFFECTS: this is usef for buttons, text links, block sections of your site, icons and more. if you want something to change colors when someone hovers their mouse over it, use the same CSS bu add :hover to it and change the styling. here's an example:  .entry h2{  font-size:36px; color: red; font-weight: 800; } .entry h2:hover{ color: gray; }....... TRANSITIONS:       for hover effects like w/ menus or images in your website, you dont want colors snapping too quickly to the end result. you ideally want to ease the change in gradually, which is where the transition property comes into play. example:    .entry h2:hover{  color: gray; transition: all 0.3s ease;   }   this makes the change happen over .3 seconds, instead of just instantly snapping to red.......BOX SIZING: box-sizing: border-box is a favorite among many web designers, because it solves the problem of padding and layout issues. Basically, when you set a box to a specific width, and add padding to it, the padding adds to the size of the box. However, with box-sizing:border-box;, this is negated, and boxes stay the size they are meant to be. ...........:before      this CSS selector is a selector that allows you to  choose a CSS element and insert content before every element w/ a specific class applied to it. lets say you had a website where you wanted specific text before every H2 tag. you would use this set up. this is extremely handy, especially if you're using an icon font.",
      "notebookId": 10,
      "id": 10,
      "rating": 0
    },
    {
      "title": "labtime react notes (taylor)",
      "date": "2019-10-26",
      "topics": "classes, arrow functions, variables ",
      "instructor": "Brenda",
      "content": "a class is a type of function, but instead of using the keyword function to initiate it, we use the keyword class and the properties are assigned inside a constructor() method. you can also add your own methods in a class. create a method named present ......... class Car { constructor(name) {this.brand = name; }      present() { return 'I have a ' + this.brand; } }   mycar = new Car('Ford'); mycar.present();      as you can see in the example, you call the method by referring to the object's name followed by parentheses which contain the paramenters.   ............CLASS INHERITANCE: to create a class inheritance, use the extends keyword. a class created w/ a class inheritance inherits all the methods from another class.      .............THIS: the handling of this is also different in arrow functions compared to regular functions. w/ arrow functions there are no binding of this. in regular functions the this keyword represented the object that called the function, which could be the window, doc, button etc. w/ arrow function the this keyword always represents the object that defined the arrow function",
      "notebookId": 7,
      "id": 11,
      "rating": 0
    },
    {
      "title": "Components-phil",
      "date": "2019-10-05",
      "topics": "react, props, components ",
      "instructor": "Brenda",
      "content": "components are independent and reusable bits of code. they serve the same purpose as JS functions, but work in isolation and returns HTML via a render function.  Components come in 2 types, class components and function components.   CLASS COMPONENTS: when creating a react component the components name must start w/ an upper case letter. the component has to include the extends react.Component statement, this statement creates an inheritance to React.Component, and gives your component access to React.Component's functions. THe component also requires a render() method, this method returns HTML............  COMPONENT CONSTRUCTOR. if theres a constructor() fxn in your component this fxn will be called when the component gets initiated. the constructor function is where you initiate the components properties. in react, component properties should be kept in an object called state. another way of handling component properties is by using props. props are like functioning arguments, and you send them into the component as attributes. example: use an attribute to pass a color to the car component and use it in the render() fxn:......    class Car extends React.Component {  render() {    return <h2>I am a {this.props.color} car!</h2>; }} ReactDOM.render(<Car color='red'/>, document.getElementById('root')); .........props are also how you pass date from one component to another as parameters. ",
      "notebookId": 11,
      "id": 12,
      "rating": 0
    },
    {
      "title": "state-nate",
      "date": "2019-10-05",
      "topics": "react, state, objects, components ",
      "instructor": "Brenda",
      "content": "The state object is where you store property values that belongs to the component. When the state object changes, the component re-renders. The state object is initialized in the constructor. Refer to the state object anywhere in the component by using the this.state.propertyname syntax.  Example class Car extends React.Component {.    Constructor(props) {.      Super(props); this.state = { brand: ‘Ford’, model: ‘mustang’, color: ‘red’, year: 1964 };  render() {   return ( <div> <h1> MY {this.state.brand}</h1> <p> it is a {this.state.color} {this.state.model} from {this.state.year}. </p> </div> ); } }. ………. To change a value in the state object, use the this.setState() method. When a value in the state object changes, the component will re-render, meaning that the output will change according to the new values. Always use the setState() method to change the state object, it will ensure that the component knows its been updated and calls the render() method (and all the other lifecycle methods)",
      "notebookId": 8,
      "id": 13,
      "rating": 0
    },
    {
      "title": "Forms-heidi",
      "date": "2019-10-09",
      "topics": "react, forms, state, objects, components ",
      "instructor": "Brenda",
      "content": "if you want to send parameters into an event handler, you have two options: 1. Make an anonymous arrow function or 2.bind the event handler to this. note that the first argument has to be this. REACT EVENT OBJECT: event handlers have access to the react event that triggered the function. In react, form data is usually handled by the components. When the data is handled by the components, all the data is stored in the component state. you can control changes by adding event handlers in the onChange attribute. Note: you must initialize the state in the constructor method before you can use it. CONDITIONAL RENDERING: if you dont want to display the h1 element until the user has done any input you can add an if statement. you can control the submit action by adding an event handler in the onSubmit attribute. event.preventDefault() is used to prevent the form from actually being submitted. .......MULTIPLE INPUT FIELDS: you can control the values of more than one input field by adding a name attribute to each element. when you initialize the state in the constructor, use the field names. to access the fields in the event handler use the event.target.name and event.target.value syntax. to update the state in the this.setState method, use square brackets [] around the property name...........>TEXTAREA:  in react, the value of a textarea is placed in a value attribute example ...render() { return (   <form> <textarea value={this.state.description} /> <form/> };................ ",
      "notebookId": 13,
      "id": 14,
      "rating": 4
    },
    {
      "id": 16,
      "title": " Heidi's React Notes 1",
      "date": "2019-10-30",
      "topics": "react, arrow functions",
      "instructor": "brenda",
      "content": "If you’re writing a simple function that just returns JSX, you can use an implicit return. You omit the curly braces and the return keyword and leave the opening and closing parentheses to wrap your JSX. As you learned earlier, including parentheses around JSX is optional, so you may see components simplified even further w/o the parentheses. There’s no real benefit to writing cmopoennts as arrow functions",
      "notebookId": 15,
      "rating": 2
    },
    {
      "id": 15,
      "title": "Heidi's react notes 2",
      "date": "2019-10-30",
      "topics": ".m,n.bmhjvjlkjlkjlkjll",
      "instructor": "bkhjgfhjdjhhhhh",
      "content": "bhjkvgcfu",
      "notebookId": 15,
      "rating": 5
    },
    {
      "title": "css tricks-nate",
      "date": "2019-7-26",
      "topics": "css, positioning, ",
      "instructor": "Michael Conrad",
      "content": "if you want control over wherean element lives on our website at all times, absolute positioning is the key to making this happen. If you think of your browser as one big bounding box, absolute positioning allows you to control exactly where in that box an element will stay. Use top, right, bottom and left, accompanied by a pixel value to control where an element stays. Setting the position to absolute can also happen in a div.        CENTERING: 1.text: text is centered using the text-align: center. if you want it to either side use left or right instead of center. 2.Content: a div or any other element can be centered by adding the block property to it, and then using auto margins. the css would look like.... display:block; margin:auto;      HOVER EFFECTS: this is usef for buttons, text links, block sections of your site, icons and more. if you want something to change colors when someone hovers their mouse over it, use the same CSS bu add :hover to it and change the styling. here's an example:  .entry h2{  font-size:36px; color: red; font-weight: 800; } .entry h2:hover{ color: gray; }....... TRANSITIONS:       for hover effects like w/ menus or images in your website, you dont want colors snapping too quickly to the end result. you ideally want to ease the change in gradually, which is where the transition property comes into play. example:    .entry h2:hover{  color: gray; transition: all 0.3s ease;   }   this makes the change happen over .3 seconds, instead of just instantly snapping to red.......BOX SIZING: box-sizing: border-box is a favorite among many web designers, because it solves the problem of padding and layout issues. Basically, when you set a box to a specific width, and add padding to it, the padding adds to the size of the box. However, with box-sizing:border-box;, this is negated, and boxes stay the size they are meant to be. ...........:before      this CSS selector is a selector that allows you to  choose a CSS element and insert content before every element w/ a specific class applied to it. lets say you had a website where you wanted specific text before every H2 tag. you would use this set up. this is extremely handy, especially if you're using an icon font.",
      "notebookId": 6,
      "id": 17,
      "rating": 0
    },
    {
      "id": 18,
      "title": "React Lifecycle phil",
      "date": "2019-10-19",
      "topics": "lifecycle methods, componentDidMount",
      "instructor": "Brenda Long",
      "content": "Each component in react has several lifecycle methods that you can override to run code at particular times in the process. Mounting methods are called in the following order when an instance of a component is being created and insterted into the DOM: constructor(), static getDerivedStateFromProps(), render(), componentDidMount(). An update can be caused by changes to props or state. these methods are called in the following order when a component is being re-rendered: static getDerivedStateFromProps(), shouldComponetUpdate(), render(), getSnapshotBeforeUpdate(), componentDidUpdate().                 The unmounting method is called when a component is being removed from the DOM: componentWillUnmount().                going into detail regarding some of the methods.... the render() method is the only required method in a class componet. when called it should examine this.props and this.state and return one of the following elements: react elements, arrays and fragments, portals, strings and numbers, booleans or null.                 componentDidMount() is invoked immediately after a component is mounted. initialization that requires DOM nodes should go here. if you need to load data from a remote endpoint, this is a good place to instantiate the network request. you may call setState() immediately in componentDidMount(). it will trigger an extra rendering, but it will happen before the browser updates the screen. this guarantees that even though the render() will be called twice in this case, the user won't see the intermediate state. ",
      "notebookId": 11,
      "rating": 4
    },
    {
      "title": "Forms-quin",
      "date": "2019-10-09",
      "topics": "react, forms, state, objects, components ",
      "instructor": "Brenda",
      "content": "if you want to send parameters into an event handler, you have two options: 1. Make an anonymous arrow function or 2.bind the event handler to this. note that the first argument has to be this. REACT EVENT OBJECT: event handlers have access to the react event that triggered the function. In react, form data is usually handled by the components. When the data is handled by the components, all the data is stored in the component state. you can control changes by adding event handlers in the onChange attribute. Note: you must initialize the state in the constructor method before you can use it. CONDITIONAL RENDERING: if you dont want to display the h1 element until the user has done any input you can add an if statement. you can control the submit action by adding an event handler in the onSubmit attribute. event.preventDefault() is used to prevent the form from actually being submitted. .......MULTIPLE INPUT FIELDS: you can control the values of more than one input field by adding a name attribute to each element. when you initialize the state in the constructor, use the field names. to access the fields in the event handler use the event.target.name and event.target.value syntax. to update the state in the this.setState method, use square brackets [] around the property name...........>TEXTAREA:  in react, the value of a textarea is placed in a value attribute example ...render() { return (   <form> <textarea value={this.state.description} /> <form/> };................ ",
      "notebookId": 14,
      "id": 19,
      "rating": 4
    },
    {
      "title": "css tricks-quin",
      "date": "2019-7-26",
      "topics": "css, positioning, ",
      "instructor": "Michael Conrad",
      "content": "if you want control over wherean element lives on our website at all times, absolute positioning is the key to making this happen. If you think of your browser as one big bounding box, absolute positioning allows you to control exactly where in that box an element will stay. Use top, right, bottom and left, accompanied by a pixel value to control where an element stays. Setting the position to absolute can also happen in a div.        CENTERING: 1.text: text is centered using the text-align: center. if you want it to either side use left or right instead of center. 2.Content: a div or any other element can be centered by adding the block property to it, and then using auto margins. the css would look like.... display:block; margin:auto;      HOVER EFFECTS: this is usef for buttons, text links, block sections of your site, icons and more. if you want something to change colors when someone hovers their mouse over it, use the same CSS bu add :hover to it and change the styling. here's an example:  .entry h2{  font-size:36px; color: red; font-weight: 800; } .entry h2:hover{ color: gray; }....... TRANSITIONS:       for hover effects like w/ menus or images in your website, you dont want colors snapping too quickly to the end result. you ideally want to ease the change in gradually, which is where the transition property comes into play. example:    .entry h2:hover{  color: gray; transition: all 0.3s ease;   }   this makes the change happen over .3 seconds, instead of just instantly snapping to red.......BOX SIZING: box-sizing: border-box is a favorite among many web designers, because it solves the problem of padding and layout issues. Basically, when you set a box to a specific width, and add padding to it, the padding adds to the size of the box. However, with box-sizing:border-box;, this is negated, and boxes stay the size they are meant to be. ...........:before      this CSS selector is a selector that allows you to  choose a CSS element and insert content before every element w/ a specific class applied to it. lets say you had a website where you wanted specific text before every H2 tag. you would use this set up. this is extremely handy, especially if you're using an icon font.",
      "notebookId": 14,
      "id": 20,
      "rating": 0
    },
    {
      "id": 21,
      "title": "Stephen's note",
      "date": "2019-10-25",
      "topics": "react",
      "instructor": "brenda",
      "content": "react is great ",
      "notebookId": 17
    }
  ],
  "reviews": [
    {
      "id": 2,
      "userId": 2,
      "username": "sage",
      "noteId": 14,
      "ratingTitle": "Thanks",
      "review": "solid notes. appreciate ya",
      "rating": 4
    },
    {
      "id": 3,
      "userId": 3,
      "username": "aryn",
      "noteId": 2,
      "ratingTitle": "Thanks",
      "review": "misssed this day in class, Solid notes, friend. thanks for posting them",
      "rating": 4
    },
    {
      "id": 10,
      "userId": 12,
      "username": "keaton",
      "noteId": 13,
      "ratingTitle": "sick",
      "review": "sick notes man",
      "rating": 4
    },
    {
      "id": 6,
      "userId": 7,
      "username": "leigh",
      "noteId": 11,
      "ratingTitle": "Thanks",
      "review": "misssed this day in class, Solid notes, friend. thanks for posting them",
      "rating": 4
    },
    {
      "id": 8,
      "userId": 12,
      "username": "keaton",
      "noteId": 16,
      "ratingTitle": "sick",
      "review": "sick notes man",
      "rating": 2
    },
    {
      "id": 11,
      "userId": 5,
      "username": "taylor",
      "noteId": 12,
      "ratingTitle": "Thanks",
      "review": "solid notes. appreciate ya",
      "rating": 5
    },
    {
      "id": 13,
      "userId": 12,
      "username": "keaton",
      "noteId": 8,
      "ratingTitle": "sick",
      "review": "sick notes man",
      "rating": 5
    },
    {
      "ratingTitle": "yay",
      "userId": 3,
      "username": null,
      "rating": 5,
      "review": "yay",
      "noteId": null,
      "id": 14
    }
  ],
  "tasks": [
    {
      "taskName": "eat foods",
      "completed": true,
      "date": "2019-10-17",
      "userId": 4,
      "id": 12
    },
    {
      "id": 13,
      "taskName": "working now",
      "completed": false,
      "date": "2019-01-01",
      "userId": 4
    },
    {
      "id": 14,
      "taskName": "eat food ",
      "completed": true,
      "date": "2019-10-26",
      "userId": 4
    },
    {
      "id": 15,
      "taskName": "Study reacttt",
      "completed": "on",
      "date": "2019-10-31",
      "userId": 3
    },
    {
      "taskName": "Study react2",
      "completed": false,
      "date": "2019-10-31",
      "userId": 3,
      "id": 16
    },
    {
      "taskName": "Study react2",
      "completed": false,
      "date": "2019-10-31",
      "userId": 2,
      "id": 17
    },
    {
      "taskName": "Study react2",
      "completed": false,
      "date": "2019-10-31",
      "userId": 1,
      "id": 18
    },
    {
      "taskName": "Study react",
      "completed": false,
      "date": "2019-11-01",
      "userId": 21,
      "id": 19
    }
  ],
  "deadlines": [
    {
      "title": "ROUND TABLE TALKSS",
      "date": "2019-10-24",
      "userId": 4,
      "id": 2
    },
    {
      "id": 4,
      "title": "lalalala momo",
      "date": "2019-01-01",
      "userId": 4
    },
    {
      "id": 5,
      "title": "work on capstone!!",
      "date": "2019-10-25",
      "userId": 4
    },
    {
      "title": "soft demo day- present capstone MVP to class (try to make it look nice)",
      "date": "2019-11-01",
      "userId": 3,
      "id": 8
    },
    {
      "id": 9,
      "title": "break startss",
      "date": "2019-11-02",
      "userId": 3
    },
    {
      "title": "AHHHHHHH",
      "date": "2019-11-01",
      "userId": 3,
      "id": 10
    }
  ],
  "friends": [
    {
      "userId": 5,
      "friendInitiate": 1,
      "id": 10
    },
    {
      "userId": 3,
      "friendInitiate": 2,
      "id": 12
    },
    {
      "userId": 2,
      "friendInitiate": 4,
      "id": 28
    },
    {
      "userId": 5,
      "friendInitiate": 4,
      "id": 29
    },
    {
      "userId": 2,
      "friendIntiate": 5,
      "id": 30
    },
    {
      "userId": 1,
      "friendInitiate": 5,
      "id": 31
    },
    {
      "userId": 2,
      "friendInitiate": 6,
      "id": 32
    },
    {
      "userId": 4,
      "friendInitiate": 5,
      "id": 36
    },
    {
      "userId": 3,
      "friendInitiate": 5,
      "id": 37
    },
    {
      "userId": 2,
      "friendInitiate": 1,
      "id": 41
    },
    {
      "userId": 4,
      "friendInitiate": 1,
      "id": 42
    },
    {
      "userId": 5,
      "friendInitiate": 3,
      "id": 45
    },
    {
      "userId": 9,
      "friendInitiate": 10,
      "id": 50
    },
    {
      "userId": 3,
      "friendInitiate": 10,
      "id": 51
    },
    {
      "userId": 6,
      "friendInitiate": 15,
      "id": 52
    },
    {
      "userId": 6,
      "friendInitiate": 3,
      "id": 54
    },
    {
      "userId": 2,
      "friendInitiate": 3,
      "id": 55
    },
    {
      "userId": 9,
      "friendInitiate": 3,
      "id": 56
    },
    {
      "userId": 4,
      "friendInitiate": 3,
      "id": 57
    },
    {
      "userId": 8,
      "friendInitiate": 16,
      "id": 58
    },
    {
      "userId": 3,
      "friendInitiate": 16,
      "id": 59
    },
    {
      "userId": 20,
      "friendInitiate": 21,
      "id": 60
    },
    {
      "userId": 19,
      "friendInitiate": 21,
      "id": 61
    },
    {
      "userId": 5,
      "friendInitiate": 21,
      "id": 62
    },
    {
      "userId": 2,
      "friendInitiate": 21,
      "id": 63
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "heidi",
      "name": "heidi",
      "password": "heidi"
    },
    {
      "username": "sage",
      "name": "sage",
      "password": "sage",
      "id": 2
    },
    {
      "username": "aryn",
      "password": "aryn",
      "name": "aryn",
      "id": 3
    },
    {
      "username": "taylor",
      "name": "taylor",
      "password": "taylor",
      "id": 4
    },
    {
      "username": "nate",
      "name": "nate",
      "password": "nate",
      "id": 5
    },
    {
      "username": "phil",
      "name": "phil",
      "password": "phil",
      "id": 6
    },
    {
      "username": "leigh",
      "name": "leigh",
      "password": "leigh",
      "id": 7
    },
    {
      "username": "quin",
      "name": "quin",
      "password": "quin",
      "id": 8
    },
    {
      "username": "mark",
      "name": "mark",
      "password": "mark",
      "id": 9
    },
    {
      "username": "lauren",
      "name": "lauren",
      "password": "lauren",
      "id": 10
    },
    {
      "username": "nick",
      "name": "nick",
      "password": "nick",
      "id": 11
    },
    {
      "username": "keaton",
      "name": "keaton",
      "password": "keaton",
      "id": 12
    },
    {
      "username": "dylan",
      "name": "dyaln",
      "password": "dyaln",
      "id": 13
    },
    {
      "username": "summer",
      "password": "summer",
      "name": "summer",
      "id": 14
    },
    {
      "username": "new",
      "password": "mew",
      "name": "",
      "id": 15
    },
    {
      "username": "chandler",
      "password": "chandler",
      "name": "chandler",
      "id": 16
    },
    {
      "username": "mo",
      "password": "mo",
      "name": "mo",
      "id": 18
    },
    {
      "username": "madi",
      "password": "madi",
      "name": "madi",
      "id": 19
    },
    {
      "username": "brenda",
      "password": "brenda",
      "name": "brenda",
      "id": 20
    },
    {
      "username": "stephen",
      "password": "stephen",
      "name": "stephen",
      "id": 21
    }
  ],
  "notebooks": [
    {
      "id": 4,
      "subject": "Aryn's Anatomy",
      "userId": 3
    },
    {
      "id": 5,
      "subject": "Aryn's physics Notebook",
      "userId": 3
    },
    {
      "subject": "Nate's CSS",
      "userId": 5,
      "id": 6
    },
    {
      "subject": "Taylor's React Notes",
      "userId": 4,
      "id": 7
    },
    {
      "subject": "Nate's React",
      "userId": 1,
      "id": 8
    },
    {
      "subject": "Phil's React",
      "userId": 6,
      "id": 11
    },
    {
      "subject": "Taylor's CSS",
      "userId": 4,
      "id": 10
    },
    {
      "subject": "Heidi's CSS Notebook",
      "userId": 1,
      "id": 13
    },
    {
      "id": 9,
      "subject": "Principles of Resistance Training",
      "userId": 3
    },
    {
      "id": 10,
      "subject": "Sage's React Notebook",
      "userId": 2
    },
    {
      "subject": "Quin's CSS Notebook",
      "userId": 8,
      "id": 14
    },
    {
      "subject": "Heidi's React Notebook",
      "userId": 1,
      "id": 15
    },
    {
      "subject": "Stephen's Notebook",
      "userId": 21,
      "id": 17
    }
  ]
}